In [1]:
import numpy as np
import pandas as pd

In [3]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [4]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [32]:
date = date.drop(columns=['product_id','city_id','orders'])

In [35]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [36]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   date             1000 non-null   datetime64[ns]
 1   date_year        1000 non-null   int32
 2   date_month       1000 non-null   int32
 3   date_day         1000 non-null   int32
 4   date_month_name  1000 non-null   object
 5   date_dow         1000 non-null   int32
 6   date_day_name    1000 non-null   object
 7   is_weekend       1000 non-null   int64
dtypes: datetime64[ns](1), int32(4), int64(1), object(2)
memory usage: 47.0+ KB

In [37]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

# Working with Dates

In [38]:
# Converting to datetime datatype
date['date'] = pd.to_datetime(date['date'])

In [39]:
date['date'].head()

0   2019-12-10
1   2018-08-15
2   2018-10-23
3   2019-08-17
4   2019-01-06
Name: date, dtype: datetime64[ns]

In [40]:
date['date_year'] = date['date'].dt.year

In [41]:
date['date_year'].head()

0    2019
1    2018
2    2018
3    2019
4    2019
Name: date_year, dtype: int32

In [42]:
date['date_month'] = date['date'].dt.month

In [43]:
date['date_month']

0      12
1       8
2      10
3       8
4       1
       ..
995    10
996    12
997     5
998     3
999    10
Name: date_month, Length: 1000, dtype: int32

In [44]:
date['date_day'] = date['date'].dt.day

In [45]:
date['date_day']

0      10
1      15
2      23
3      17
4       6
       ..
995     8
996     6
997     7
998     3
999    15
Name: date_day, Length: 1000, dtype: int32

In [46]:
date['date_month_name'] = date['date'].dt.month_name()

date.head()

,date,date_year,date_month,date_day,date_month_name,date_dow,date_day_name,is_weekend
0,2019-12-10,2019,12,10,December,1,Tuesday,0
1,2018-08-15,2018,8,15,August,2,Wednesday,0
2,2018-10-23,2018,10,23,October,1,Tuesday,0
3,2019-08-17,2019,8,17,August,5,Saturday,1
4,2019-01-06,2019,1,6,January,6,Sunday,1

In [47]:
date['date_dow'] = date['date'].dt.dayofweek

date.head()

,date,date_year,date_month,date_day,date_month_name,date_dow,date_day_name,is_weekend
0,2019-12-10,2019,12,10,December,1,Tuesday,0
1,2018-08-15,2018,8,15,August,2,Wednesday,0
2,2018-10-23,2018,10,23,October,1,Tuesday,0
3,2019-08-17,2019,8,17,August,5,Saturday,1
4,2019-01-06,2019,1,6,January,6,Sunday,1

In [49]:
date['date_day_name'] = date['date'].dt.day_name()

In [50]:
date['is_weekend'] = np.where(date['date_day_name'].isin(['Sunday','Saturday']),1,0)

In [51]:
date.head()

,date,date_year,date_month,date_day,date_month_name,date_dow,date_day_name,is_weekend
0,2019-12-10,2019,12,10,December,1,Tuesday,0
1,2018-08-15,2018,8,15,August,2,Wednesday,0
2,2018-10-23,2018,10,23,October,1,Tuesday,0
3,2019-08-17,2019,8,17,August,5,Saturday,1
4,2019-01-06,2019,1,6,January,6,Sunday,1

In [53]:
date['date_week'] = date['date'].dt.isocalendar().week

In [54]:
date.head()

,date,date_year,date_month,date_day,date_month_name,date_dow,date_day_name,is_weekend,date_week
0,2019-12-10,2019,12,10,December,1,Tuesday,0,50
1,2018-08-15,2018,8,15,August,2,Wednesday,0,33
2,2018-10-23,2018,10,23,October,1,Tuesday,0,43
3,2019-08-17,2019,8,17,August,5,Saturday,1,33
4,2019-01-06,2019,1,6,January,6,Sunday,1,1

In [55]:
date['quarter'] = date['date'].dt.quarter

In [56]:
date.head()

,date,date_year,date_month,date_day,date_month_name,date_dow,date_day_name,is_weekend,date_week,quarter
0,2019-12-10,2019,12,10,December,1,Tuesday,0,50,4
1,2018-08-15,2018,8,15,August,2,Wednesday,0,33,3
2,2018-10-23,2018,10,23,October,1,Tuesday,0,43,4
3,2019-08-17,2019,8,17,August,5,Saturday,1,33,3
4,2019-01-06,2019,1,6,January,6,Sunday,1,1,1

In [57]:
date['semester'] = np.where(date['quarter'].isin([1,2]), 1, 2)

In [58]:
# Extract Time elapsed between dates
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2025, 8, 19, 2, 35, 56, 73499)

In [59]:
today - date['date']

0     2079 days 02:35:56.073499
1     2561 days 02:35:56.073499
2     2492 days 02:35:56.073499
3     2194 days 02:35:56.073499
4     2417 days 02:35:56.073499
                 ...
995   2507 days 02:35:56.073499
996   2448 days 02:35:56.073499
997   2296 days 02:35:56.073499
998   2361 days 02:35:56.073499
999   2135 days 02:35:56.073499
Name: date, Length: 1000, dtype: timedelta64[ns]

In [60]:
(today - date['date']).dt.days

0      2079
1      2561
2      2492
3      2194
4      2417
       ...
995    2507
996    2448
997    2296
998    2361
999    2135
Name: date, Length: 1000, dtype: int64

In [61]:
# Months passed

np.round((today -date['date']) / np.timedelta64(1, 'M'),0)

ValueError: Unit M is not supported. Only unambiguous timedelta values durations are supported. Allowed units are 'W', 'D', 'h', 'm', 's', 'ms', 'us', 'ns'

In [62]:
time['date'] = pd.to_datetime(time['date'])

In [63]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [64]:
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [65]:
today - time['date']

0     4265 days 01:45:56.073499
1     4129 days 02:55:56.073499
2     4615 days 02:14:56.073499
3     3917 days 02:04:56.073499
4     4314 days 03:24:56.073499
                 ...
995   4904 days 01:45:56.073499
996   4225 days 03:21:56.073499
997   4690 days 02:58:56.073499
998   4806 days 03:01:56.073499
999   4078 days 03:10:56.073499
Name: date, Length: 1000, dtype: timedelta64[ns]

In [66]:
(today - time['date'])/np.timedelta64(1,'s')

0      3.685024e+08
1      3.567562e+08
2      3.987441e+08
3      3.384363e+08
4      3.727419e+08
           ...
995    4.237120e+08
996    3.650521e+08
997    4.052267e+08
998    4.152493e+08
999    3.523507e+08
Name: date, Length: 1000, dtype: float64

In [67]:
(today - time['date'])/np.timedelta64(1,'m')

0      6.141706e+06
1      5.945936e+06
2      6.645735e+06
3      5.640605e+06
4      6.212365e+06
           ...
995    7.061866e+06
996    6.084202e+06
997    6.753779e+06
998    6.920822e+06
999    5.872511e+06
Name: date, Length: 1000, dtype: float64

In [68]:
(today - time['date'])/np.timedelta64(1,'h')

0      102361.765576
1       99098.932243
2      110762.248909
3       94010.082243
4      103539.415576
           ...
995    117697.765576
996    101403.365576
997    112562.982243
998    115347.032243
999     97875.182243
Name: date, Length: 1000, dtype: float64